Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: In the context of function definitions, the ... operator is used to combine many different arguments into a single argument.
ja: 関数定義のコンテキストでは、.…演算子は、多くの異なる引数を結合するために使用されます。 単一の引数に。

source: In the example above, the code between = and = is run as a bash
ja: 上記の例では、=と=の間のコードは、bashのように実行されます。

source: In the example above, we see that the "current world" (in which the method newfun() exists), is one greater than the task-local "runtime world" that was fixed when the execution of tryeval started.
ja: 上記の例では、メソッドnewfun()が存在する「現在の世界」が、tryeval開始時に設定されたタスクローカルの「実行時の世界」よりも１つ大きいことがわかります。

source: In the example function, f, from the previous section this is the value of the expression x + y.
ja: 例えば、前節に出てきた fという関数の戻り値は 、式x + y.の値です。

source: In the example manifest file above, to find the path of the first Priv package—the one with UUID ba13f791-ae1d-465a-978b-69c3ad90f72b—Julia looks for its stanza in the manifest file, sees that it has a path entry, looks at deps/Priv relative to the App project directory—let's suppose the App code lives in /home/me/projects/App—sees that /home/me/projects/App/deps/Priv exists and therefore loads Priv from there.
ja: 上記のサンプル・マニフェスト・ファイルでは、最初のPrivパッケージのパスを検索するには、UUIDba13f791-ae1d-465a-978b-69c3ad90f72b-Juliaは、マニフェスト・ファイル内のスタンザを検索します。パスは、アプリケーション/home/me/projects/App/home/me/projects/App/deps/Privは、/home/me/projects/App/deps/Privは、/home/me/projects/App/deps/Privであることを示しています。

source: In the expression a && b, the subexpression b is only evaluated if a evaluates to true.
ja: a && bという式で、bが評価されるのは、aの評価が真のときのみです。

source: In the expression a || b, the subexpression b is only evaluated if a evaluates to false.
ja: a || bという式で、bが評価されるのは、aの評価が偽の時のみです。

source: In the expression A[I_1, I_2, ..., I_n], each I_k may be a scalar index, an array of scalar indices, or an object that represents an array of scalar indices and can be converted to such by `to_indices`:
ja: 式A[I_1,I_2,…I_n]では、各I_kはスカラーインデックスであってもよいし スカラの配列、またはスカラーの配列を表すオブジェクト インデックスは、からまでに変換することができます。

source: In the following example, the method type parameter T is used as the return value:
ja: 次の例では、メソッドの型パラメータ Tが戻り値として使用されています。

source: In the following list of such functions, calls with a dims... argument can either take a single tuple of dimension sizes or a series of dimension sizes passed as a variable number of arguments.
ja: 以下の一覧 そのような関数は、ディムスを持つ関数です。引数を指定すると、1組の寸法サイズをとることができます。 または、変数の数として渡される一連の次元サイズを指定します。

source: In the future, however, it may do so, yielding even greater performance gains.)
ja: 将来は しかし、それによってパフォーマンスが向上する可能性があります。

source: In the most general case, an array may contain objects of type `Any`.
ja: 最も一般的なケースでは 配列は、'のタイプのオブジェクトを含むことができます。<x/><x/>.

source: In the previous example, the println call is shared by all three branches: the only real choice is which literal string to print.
ja: 前の例では printlnコールは3つのブランチすべてで共有されます。唯一の実際の選択は、次のいずれかです。 印刷。

source: In the second construct, i will be an Int if A is an array type with fast linear indexing; otherwise, it will be a CartesianIndex:
ja: 2番目の 構成,iはIntであり,Aが高速線形インデックスを用いたアレイ型である場合は,それ以外の値である。 CartesianIndexになります。

source: In these cases, the alternative (but fully equivalent) keyword in or ∈ is typically used instead of =, since it makes the code read more clearly:
ja: これらの場合には (ただし、)のキーワードは、<x x/>=の代わりに一般的に使用されます。 コードはより明確に読まれます

source: In these situations, the anonymous function construct allows easy creation of a single-use function object without needing a name:
ja: そんな時、無名関数を使えば、使い捨ての関数オブジェクトを名前もつけずに簡単に作成できます。

source: In this case, the expression must evaluate to a Ptr, which will be used as the address of the native function to call.
ja: この 例:式は、ネイティブのアドレスとして使用されるPtrに評価される必要があります。 関数が呼び出されます。

source: In this case the final (empty) line before the closing """ sets the indentation level.
ja: この場合、閉じる """ の前の最後の（空の）行はインデントレベルを定義します。

source: In this case the result is 5, because f(1,2) invokes the first method of f above.
ja: この場合、結果は5で、f(1,2)は最初のfメソッドを呼び出すからです。

source: In this case there will be no hidden arguments, at the cost of some language features (e.g. only character(len=1) will be permitted to pass strings).
ja: この場合は、隠れた引数はありません。 言語機能(例えば、文字(len=1)は文字列を渡すことが許されます)。

source: In this case, the character ∀ is a three-byte character, so the indices 2 and 3 are invalid and the next character's index is 4; this next valid index can be computed by `nextind(s,1)`, and the next index after that by nextind(s,4) and so on.
ja: この場合、∀ は3バイト文字であるため、インデックス2と3は無効であり、次の有効なインデックスは4になります。 また、この場合、次の有効なインデックスは`nextind(s,1)`,で求めることができ、その次の有効なインデックスは nextind(s,4) で計算でき、 その次は...と求めることができます。

source: In this example it is accomplished by defining Base.similar{T}(A::SparseArray, ::Type{T}, dims::Dims)
ja: この例では、のような{T}(A::SparseArray,::Type{T},dims::Dims)を定義することによって達成される。

source: In this example, observe that the new definition for newfun has been created, but can't be immediately called.
ja: この例では、newfunの新しい定義は作成されましたが、すぐには呼び出せないことに注意してください。

source: In this example, the compiler will replace all instances of @sayhello with:
ja: この例では、@sayhelloのインスタンスの全てを

source: In this example, the tuple (1,2,3) is interpolated as an expression into a conditional test:
ja: この例では、タプル(1,2,3)は条件付きテストへの式として補間されます。

source: In this example, the value of variable a is interpolated:
ja: この例では、変数aの値が補間されます。

source: In this specific example, + and a are symbols, *(b,c)
ja: この具体的な例では、+とaは、記号であり、*(b,c)である。

source: In this style of definition, the code generation feature is essentially an optional optimization.
ja: この定義の定義では、コード生成機能は基本的にオプションです。 最適化。

source: In-place broadcasting can be supported by defining the appropriate copyto!(dest, bc::Broadcasted)
ja: インプレースブロードキャストは、適切なcopyto!(dest,bc::Broadcast)を定義することでサポートできます。

source: Including this file should create a module named X.
ja: このファイルを含めて、Xという名前のモジュールを作成する必要があります。

source: Inclusion allows you to split a single program across multiple source files.
ja: インクルージョンを使用すると、複数のソースファイルにわたって単一のプログラムを分割できます。

source: Incomplete Initialization
ja: 不完全な初期化

source: Inconsistencies can cause code that works correctly on one system to fail or produce indeterminate results on a different system.
ja: 不整合 は、1つのシステム上で正しく動作するコードを生成することができます。 別のシステムです。

source: Increasing the index of dimension k by 1 should increase the index i of `getindex(A,i)` by `stride(A,k)`.
ja: 増加 1の寸法kは、'getindex(A,i)'のインデックスiを増加させます。 `stride(A,k)`.

source: Indeed, any new method definition won't be visible to the current runtime environment, including Tasks and Threads (and any previously defined @generated functions).
ja: 実際、新しいメソッド定義は、タスクおよびスレッド（およびそれ以前に定義された@generated関数）を含め、現在の実行時環境ではまったく見えません。

source: Indexed assignment syntax without the end keyword is equivalent to a call to `setindex!`:
ja: インデックス付きの割り当て endキーワードがない構文は、次のような呼び出しに相当します。 `setindex!`:

source: Indexing
ja: インデックス

source: Indexing by a boolean vector B is effectively the same as indexing by the vector of integers that is returned by `findall(B)`.
ja: ブール型ベクトルBによるインデックス作成は、実効的には、以下のようにして行われる。 `findall(B)`によって返される整数のベクトル。

source: Indexing syntax without the end keyword is equivalent to a call to `getindex`:
ja: endキーワードなしのインデックス構文は、`getindex'への呼び出しと同じです。

source: Indexing with anything other than an Int will throw a `MethodError` saying that there was no matching method.
ja: インデックス作成 Int以外の何かは、一致する方法がないことを示す'MethodError'をスローします。

source: Inf is equal to itself and greater than everything else except NaN.
ja: Inf はそれ自体と等しく、 NaN を除く全てよりも大きいです。

source: Inference on the generated function may be run at any time, including while your code is attempting to observe or mutate this state.
ja: 生成された関数の推論は、コードが試行されている間も、<x x/><x x2/>時間で実行されることがあります。 この状態を観察または突然変異させます。

source: Inner Constructor Methods
ja: 内部コンストラクタのメソッド

source: InsertionSort is an O(n^2) stable sorting algorithm.
ja: InsertionSortは、O(n^2)安定ソートアルゴリズムである。

source: Inside the then part of the if @generated block, code has the same semantics as other generated functions: argument names refer to types, and the code should return an expression.
ja: のの中で、@生成されたブロックの場合、コードは他のものと同じ意味を持つ。 生成された関数:引数名は型を参照し、コードは式を返す必要があります。

source: Instead of mutating objects as they are iterated over, Julia iterators may keep track of the iteration state externally from the object.
ja: 代わりに 反復されるときにオブジェクトをミューテートすることで、ジュリア反復子は追跡することができる オブジェクトからの繰り返し状態の繰り返し状態です。

source: Instead define a convert method and pass the variables directly to the `ccall`.
ja: 代わりに変換メソッドを定義して、変数を直接`ccall'に渡します。

source: Instead of if <cond> <statement> end, one can write <cond> && <statement> (which could be read as: <cond> and then <statement>).
ja: if <条件式> <実行文> endの代わりに、 <条件式> && <実行文>と書けます （&&は、"の時は" と読み下せます)。

source: Instead of if end, one can write && (which could be read as:
ja: endではなく、&&(これは以下のようなものがあります)<x x/>( read as:

source: Instead of defining all these behaviors ourselves, we can officially define it as a subtype of an `AbstractArray`.
ja: これらすべての行動を定義する代わりに 私たちは、公式には、'AbstractArray'のサブタイプとして定義することができます。

source: Instead of directly sorting an array, you can compute a permutation of the array's indices that puts the array into sorted order:
ja: 配列を直接ソートする代わりに、配列のインデックスの置換を計算することができます。 配列をソートされた順序に配置します。

source: Instead, declare an isbits struct type and use that instead.
ja: 代わりに、イスビトス構造体を宣言し、代わりにそれを使用します。

source: Instead, it queries them through internal APIs and lazily computes only as much of each structure as it needs to load a given package.
ja: その代わりに、内部APIを介してクエリーを実行し、特定のパッケージをロードする必要がある場合と同じように、各構造体のほとんどを計算することができます。

source: Instead, packages are identified by universally unique identifiers (UUIDs) which are assigned to them before they are registered.
ja: その代わりに、パッケージは、登録される前に割り当てられたユニバーサル一意識別子(UUID)によって識別されます。

source: Instead, the multiplication must be explicitly written out:
ja: その代わりに、乗算は明示的に書き出される必要があります。

source: Instead, use the more efficient `complex` function to construct a complex value directly from its real and imaginary parts:
ja: 代わりに、より効率的な'コンプレックス'関数を使用して構築する 実部と虚部から直接的に複雑な値が得られます

source: Int(round(x)).
ja: Int(round(x)) の短縮系です。

source: Integer division (the div function) has two exceptional cases: dividing by zero, and dividing the lowest negative number (typemin) by -1.
ja: 整数除算(div 関数)は2つの例外的なケースを持っています: 0で除した場合。最も低い負の数(typemin)を-1でで除した場合。

source: Integer division (the div function) has two exceptional cases: dividing by zero, and dividing the lowest negative number (`typemin()`) by -1.
ja: 整数の除算（ div関数）には、0で割る、最小の負の数（ `typemin()`)）を−1で割るの2つの 例外的ケースがあります。

source: Integer division (the div function) has two exceptional cases: dividing by zero, and dividing the lowest negative number (`typemin`) by -1.
ja: 整数除算(div関数)は2つの例外的なケースを持っています:0で除算して除算します。 -1で最も低い負の数(`テーパミン')。

source: Integer types:
ja: 整数型:

source: Integer value N launches N additional local worker processes; auto launches as many workers as the number of local CPU threads (logical cores)
ja: 整数値Nは、N個のローカル・ワーカー・プロセスを起動します。autoは、ローカルCPUスレッド(論理コア)の数と同じ数のワーカーを起動します。

source: Integers
ja: 整数

source: Integers and floating-point values are the basic building blocks of arithmetic and computation.
ja: 整数と浮動小数点値は、演算処理の基本的要素です。

source: Integers are compared in the standard manner -- by comparison of bits.
ja: 整数は標準的な方法（ビットの比較）により比較されます。

source: Interacting with the contents or methods of Core.Compiler in any way.
ja: コアの内容または方法との相互作用。コンパイラは任意の方法で動作します。

source: Interactive mode; REPL runs and isinteractive() is true
ja: Interactiveモード;REPLは実行され、イスインタラクティブ()はtrueです。

source: Internally, this code creates two implementations of the function: a generated one where the first block in if @generated is used, and a normal one where the else block is used.
ja: 内部的には、このコードは次の2つの実装を作成します:a生成された関数: の最初のブロックは、@generatedが使用され、かつ<x/>elseブロックが使用される通常のブロックである。

source: Interpolating into an unquoted expression is not supported and will cause a compile-time error:
ja: 引用符で囲まれていない式への補間はサポートされておらず、コンパイル時エラーが発生します。

source: Interpolation
ja: 補間

source: Interpolation is indicated by a prefix $.
ja: 補間はプレフィックス$で示されます。

source: It also allows comparing the methods available in two worlds just by comparing their ordinal value.
ja: また、世代を比較するだけで、2つの世界で利用できるメソッドを比較することもできます。

source: It also indicates the file and line number where the methods were defined: because these methods were defined at the REPL, we get the apparent line number none:1.
ja: また、メソッドが定義されたファイルと行番号も表示されます。 これらのメソッドはREPLで定義されているため、見かけの行番号none:1が表示されます。

source: It also makes writing exponential functions more elegant:
ja: また、指数関数を簡潔に記載することが可能です。:

source: It also provides a single general outer Point constructor that takes pairs of real arguments, which must be of the same type.
ja: また、単一の一般的な 外部ポイントコンストラクタで、実際の引数のペアを指定します。このコンストラクタは、同じタイプである必要があります。

source: It can also be used directly in a `for` loop since the syntax:
ja: 構文は、構文が次のように指定されているため、<x x/>ループでは直接で使用することもできます。

source: It can even be combined with a :
ja: また、:と組み合わせることもできます。

source: It does this by creating and manipulating project files that describe what your project depends on, and manifest files that snapshot exact versions of your project's complete dependency graph.
ja: これはプロジェクトファイルを記述するプロジェクトファイルを作成して操作することによって、プロジェクトの完全な依存関係グラフの正確なバージョンをスナップショットで表示するファイルを作成することによって実現されます。

source: It gets its name from being the only operator in most languages taking three operands:
ja: その名前が唯一の演算子となります。 ほとんどの言語で3つのオペランドを使用しています。

source: It has a special compilation rule: a homogeneous tuple of VecElement{T} maps to an LLVM vector
ja: それは特別なコンパイル規則をもち、VecElement{T}マップの同種タプルをLLVMベクトルにマッピングする。

source: It has access to a special locally existent function called `new` that creates objects of the block's type.
ja: それは、オブジェクトを作成する'新しいという特別なローカルに存在する機能にアクセスすることができます。 ブロックのタイプ。

source: It is multi-paradigm, combining features of imperative, functional, and object-oriented programming.
ja: Juliaは命令型プログラミング・関数型プログラミング・オブジェクト指向プログラミングの機能を組み合わせたマルチパラダイム言語です。

source: It is also often useful to allow iteration over a collection in reverse order
ja: また、逆順でのコレクションでの反復を可能にすることも、しばしば有用である。

source: It is common for the same conceptual function or operation to be implemented quite differently for different types of arguments: adding two integers is very different from adding two floating-point numbers, both of which are distinct from adding an integer to a floating-point number.
ja: 概念的には等しい関数や演算が、引数の型によって実装がまったく異なる、ということはよくあります。 2つの整数を足すことと、2つの浮動小数点数を足すことは、全く異なるし、整数に浮動小数点数を足すこととも異なります。

source: It is considered unsafe because converting an object to a native pointer can hide the object from the garbage collector, causing it to be freed prematurely.
ja: それは安全ではないと考えられている。 オブジェクトをネイティブ・ポインタに変換すると、ガーベッジ・コレクターからオブジェクトを非表示にすることができます。 早期に解放することです。

source: It is critical to exactly match the declared C type with its declaration in Julia.
ja: 宣言されたCタイプと、Juliaで宣言された宣言を正確に一致させることが重要です。

source: It is critical to exactly match the declared C type with its declaration in Julia. Inconsistencies can cause code that works correctly on one system to fail or produce indeterminate results on a different system.
ja: 宣言されたCタイプと、Juliaの宣言を正確に一致させることが重要です。 は、1つのシステム上で正しく動作するコードを生成することができます。 別のシステムです。

source: It is declared inside the block of a type declaration, rather than outside of it like normal methods.
ja: それは、通常のメソッドのような外部ではなく、型宣言のブロック内で宣言されています。

source: It is defined by-value, and is stored without a type-tag.
ja: これは値によって定義され、タイプタグなしで保存されます。

source: It is defined by-value, and may be stored with a type-tag.
ja: それは値によって定義され、タイプタグとともに格納されることがある。

source: It is efficient for very small n, and is used internally by QuickSort.
ja: 非常に小さいnに対しては効率的である。 は、QuickSortによって内部的に使用されています。

source: It is generally more efficient to use boolean arrays as indices directly instead of first calling `findall`.
ja: 一般的に、boolean配列を使用する方が効率的です。 は、最初の呼び出し'findallを呼び出すのではなく、直接インデックスを作成します。

source: It is good practice to provide as few inner constructor methods as possible: only those taking all arguments explicitly and enforcing essential error checking and transformation.
ja: できるだけ少ないインナーコンストラクタメソッドを提供することは良い習慣ですが、それだけでよいのです。 すべての引数を明示的に取得し、必須のエラーチェックと変換を実行します。

source: It is often quite useful, however, to have access to some of your favorite tools—standard libraries, profilers, debuggers, personal utilities, etc.—even if they are not dependencies of the project you're working on.
ja: しかし、自分が作業しているライブラリ、Profilers、デバッガ、パーソナルユーティリティーなどにアクセスできるのは、作業中の依存関係ではなくても、よくあることです。

source: It is parameterized by the number of dimensions N and the element type T.
ja: パラメータは、パラメータによってパラメータ化されます。 次元の数Nと、エレメント・タイプT。

source: It is possible to constrain the number of values passed as a variable argument; this will be discussed later in Parametrically-constrained Varargs methods.
ja: 変数引数として渡される値の数を制限することは可能です。これについては、以下を参照してください。 パラメトリックに拘束されたVarargsメソッドの後にあります。

source: It is possible to define a set of function methods such that there is no unique most specific method applicable to some combinations of arguments:
ja: ある種の引数の組み合わせに対しては、最も特化するメソッドが一意に定まらない、関数メソッドの組み合わせに、定義がなってしまう可能性があります。

source: It is possible to pass Julia functions to native C functions that accept function pointer arguments.
ja: 関数ポインタ引数を受け入れるネイティブC関数にJulia関数を渡すことができます。

source: It is possible to pass Julia functions to native C functions that accept function pointer arguments. For example, to match C prototypes of the form:
ja: 関数ポインタ引数を受け入れるネイティブC関数にJulia関数を渡すことができます。 たとえば、フォームのCプロトタイプに一致させるには、次のようにします。

source: It is recommended that the disambiguating method be defined first, since otherwise the ambiguity exists, if transiently, until the more specific method is defined.
ja: 曖昧さのないメソッドを最初に定義することが推奨されます。というのも、一時的にせよ、より特化したメソッドが定義されるまで、曖昧さが残るからです。

source: It is recommended that these operations have nearly constant time complexity, or technically Õ(1) complexity, as otherwise some array functions may be unexpectedly slow.
ja: これらの操作は、次のように操作することをお勧めします。 ほとんど一定の時間的複雑さ(技術的には1)、あるいは技術的には複雑さがある 機能が予期せぬほど遅くなります。

source: It is recommended to also define `firstindex` to specify the first valid index:
ja: また、最初の有効なインデックスを指定するには、'firstindexを定義することをお勧めします。

source: It is significant that like if-elseif-else, the expressions before and after the : are only evaluated if the condition expression evaluates to true or false, respectively:
ja: 重要なのは、if-elseif-elseの場合と同様に、 : の前後の式は、それぞれ条件式が真・偽の時、そしてその時だけ、評価されるということです。

source: It is sometimes convenient to terminate the repetition of a while before the test condition is falsified or stop iterating in a for loop before the end of the iterable object is reached.
ja: whileループで、条件式が偽になる前に繰り返しを終了したり、forループで、最後のイテラブル・オブジェクトに達する前に反復を止めたりすると、便利なことがあります。

source: It is sometimes useful to close (unload) a library so that it can be reloaded.
ja: ライブラリを閉じる(アンロードする)ことによって、ライブラリを再ロードすることができます。

source: It is sometimes useful to perform element-by-element binary operations on arrays of different sizes, such as adding a vector to each column of a matrix.
ja: 異なる要素のバイナリ・バイナリ・バイナリ・オペレーションを実行する場合には、次のようにします。 行列の各列にベクトルを追加するなどのサイズです。

source: It is sometimes useful to perform element-by-element binary operations on arrays of different sizes, such as adding a vector to each column of a matrix. An inefficient way to do this would be to replicate the vector to the size of the matrix:
ja: 異なる要素のバイナリ・バイナリ・バイナリ・オペレーションを実行する場合には、次のようにします。 行列の各列にベクトルを追加するなどのサイズです。効率的な方法はありません。 ベクトルをマトリックスのサイズに複製することができます。

source: It is stored and defined by-value.
ja: それは値によって保存され、定義される。

source: It is strongly recommended not to use expressions with side effects (such as printing) in chained comparisons.
ja: 連続した比較で副次効果のある式（印刷など）を使用しないことを推奨します。

source: It is the default algorithm for non-numeric data.
ja: これは、非数値データのデフォルトアルゴリズムです。

source: It is worth noting that you do not need to (and should not) define both argument orders of this call; defining one is sufficient no matter what order the user supplies the arguments in.
ja: 両方の引数の両方を定義する必要はありませんが、両方の命令を定義する必要はありません。 この呼び出しの定義では、ユーザが引数を指定する順序にかかわらず、一つだけで十分であることになります。

source: It may often be useful, however, to write more general methods where the declared parameter types are abstract:
ja: しかし、宣言するパラメータの型が抽象的な、汎化メソッドを書くと、けっこう役に立つかもしれません。。

source: It needs to be called to obtain an Exception object:
ja: 例外オブジェクトを取得するには、次のコマンドを呼び出す必要があります。

source: It then computes the slug for this UUID/SHA-1 pair, which is HDkr (the exact details of this computation aren't important, but it is consistent and deterministic).
ja: その後、このUUID/SHA-1対のslugを計算します。HDkr(この計算の正確な詳細は重要ではありませんが、一貫性があり決定論的です)。

source: It will be evaluated and returned depending on the preceding conditionals:
ja: それは 前の条件に応じて評価され、返されます。

source: It's easy to experiment with this behavior:
ja: これは簡単に試してみることができます：

source: It's useful when you want to store a value (that you obtained after some math, for example) for later use.
ja: これは、 計算によって得た値などを後に使用するために保存する際に便利です。

source: Iterating over the CartesianIndices of the axes(::Broadcasted) and using indexing with the resulting CartesianIndex object to compute the result.
ja: 軸のCartesianIndicesを繰り返し(::ブロードキャスト)を使用して繰り返します。 結果の計算には、結果のCartesianIndexオブジェクトを使用してインデックスを作成します。

source: Iteration
ja: 反復

source: Its ith element is populated by A[2, I[i], 3].
ja: そのi番目の要素は、A[2,I[I],3]で占められている。

source: Its implementation uses `hash`
ja: その実装は、'ハッシュを使用します。

source: Julia functions are not pure mathematical functions, in the sense that functions can alter and be affected by the global state of the program.
ja: 関数は、純粋に数学的な関数ではありません。プログラムのグローバルな状態を変更したり、逆に、グローバルな状態に影響を受けたりします。

source: Julia makes dealing with plain ASCII text simple and efficient, and handling Unicode is as simple and efficient as possible.
ja: JuliaはASCIIテキストの取り扱いをシンプルかつ効率的にし、Unicodeの取り扱いも同様に可能な限りシンプル かつ効率的にします。

source: Julia Base Type
ja: ジュリア・ベース・タイプ

source: Julia Base contains a range of functions and macros appropriate for performing scientific and numerical computing, but is also as broad as those of many general purpose programming languages.
ja: Julia Baseには、実行するために適切な関数とマクロが含まれています。 科学的・数値的計算ではあるが、一般的なプログラミングと同様に広範なものである 言語。

source: Julia aims to create an unprecedented combination of ease-of-use, power, and efficiency in a single language.
ja: Juliaは、扱いやすさ・強力さ・効率性の前例のない組み合わせを1つの言語で実現しようとしています。

source: Julia allows the dispatch process to choose which of a function's methods to call based on the number of arguments given, and on the types of all of the function's arguments.
ja: Juliaでは、ディスパッチの過程で、関数のメソッドのどれを呼び出すか、関数のすべての引数の型と個数に基づいて、選択できます。

source: Julia also defines the types Int and UInt, which are aliases for the system's signed and unsigned native integer types respectively:
ja: また、Juliaは、IntとUInt の型を定義します。 これらは、それぞれ、システムの符号つきと符号なしのネイティブの整数型の別名（エイリアス）です。

source: Julia also provides * for string concatenation:
ja: Juliaは * も文字列連結の記述として提供しています。

source: Julia also provides the nextfloat and prevfloat functions which return the next largest or smallest representable floating-point number to the argument respectively:
ja: また、Juliaは、nextfloatと、prevfloat関数を提供します。 引数に対して次の最大または最小の表現可能浮動小数点数をそれぞれ指定します。

source: Julia also provides the `nextfloat()` and `prevfloat()` functions which return the next largest or smallest representable floating-point number to the argument respectively:
ja: Juliaは、次の最大または最小の浮動小数点数を引数に戻り値として与える `nextfloat()` および `prevfloat()`関数を提供しています。:

source: Julia also provides the `nextfloat` and `prevfloat` functions which return the next largest or smallest representable floating-point number to the argument respectively:
ja: また、Juliaは、`ネクトフロート'と、'プレビフロート'関数を提供します。 引数に対して次の最大または最小の表現可能浮動小数点数をそれぞれ指定します。

source: Julia applies the following order and associativity of operations, from highest precedence to lowest:
ja: Juliaは、最高優先順位から最低への順序付けと関連付けを適用し、次の順序を適用します。
